[
  {
    "path": "posts/2021-11-29-us-education-energy-poverty-nexus/",
    "title": "U.S. Education-Energy Poverty Nexus",
    "description": "An exploratory analysis of the relationship between education and energy burden in the U.S.",
    "author": [
      {
        "name": "Desik Somasundaram",
        "url": {}
      }
    ],
    "date": "2021-11-29",
    "categories": [],
    "contents": "\n\nContents\nIntroduction\nDatasets Used\nAnalysis Plan: Three Stages\nPart 1\nPart 2\nPart 3\n\nResults\nConclusions and Next steps\nReferences\n\nIntroduction\nPremise: Energy poverty is one of the significant challenges for developing countries of the world with more than a billion people around the world lacking access to simple technologies such as lamps and appliances. The idea that the lack of access to lighting at night or heating/cooling during thermal comfort could impact children and their ability to perform well in school seems apparent. Several studies have concluded households with a low level of educational attainment have more limited access to electricity and other forms of clean energy (Apergis, Polemis, and Soursou 2021). It’s evident that there’s potential for a vicious cycle where energy poverty is hindering education which in turn is decreasing their ability to escape it; ultimately depriving people of a higher quality life.\nQuestion: Do these relationships between energy poverty and education hold true in the United States (the developed country context, based on GDP)?\nMotivation: There is a lack of research connecting education and energy poverty in the US. Though electricity access is prevalent in the U.S., anticipated increased variability in climate could make the U.S. particularly vulnerable. The disparities in energy equity considering income and race across the US are not recognized as a problem at the federal level, therefore limiting the response to this issue unlike the gradual and coordinated response in countries such as the UK (Bednar and Reames 2020). The goal of this project is to encourage more research through the education-energy poverty nexus lens.\nDatasets Used\nThe analysis was conducted on the county level in the US due to the increased sampling power and available data resolution for parameters in question.\nEducational Attainment data available on the county-level from the USDA Economic Research Service, the most recent data is available for 2015 to 2019. An example of statewide data is shown for the entire US in Figure 1. (Link: https://data.ers.usda.gov/reports.aspx?ID=17829)\n\n\n\nFigure 1: Educational Attainment in US\n\n\n\nComprehensive County Indicators data from County Health Rankings which compiles data from several data sources. The final analysis used the math and reading score indicators from this dataset that are modelled by Stanford Education Data Archive program based on EDFacts and state sources to achieve comparability across the country. Although the dataset is labelled as 2021 data, the testing score is actually based on 2018. The math and reading scores are presented as average grade level performance for 3rd graders. The scores generally range from 1 to 4. The expected value is 3 indicating that 3rd graders are performing at a 3rd grade level. A score of 3.5 would they are perform 0.5 a grade level higher than expected. (Link: https://www.countyhealthrankings.org/explore-health-rankings/rankings-data-documentation)\nLow-Income Energy Affordability data available on county-level from the Department of Energy based on modelling done using the 2016 5-year American Community Survey (ACS5). An example of California data is shown in Figure 2. This analysis will focus on energy burden which represents the % income a household must spend on energy to meet their needs. (Link: https://www.energy.gov/eere/slsc/low-income-energy-affordability-data-lead-tool)\n\n\n\nFigure 2: California LEAD tool by county\n\n\n\nLimitations of the the datasets used:\nThe LEAD energy affordability estimates are centered around housing energy costs. While this is important, an entire dimension of inequity due to energy poverty and mobility is missed out on due to the lack of information on transportation sector.\nWith county-level resolution in US being so challenging to achieve, it’s important to note that there are several processes of modelling and estimations incorporated into the available datasets for the education data and LEAD tool that must be considered and noted. Biases could arise due to response bias and attrition for the surveys such as the American Community Survey (ACS) that are heavily relied on.\nNevertheless, this analysis will use the best available data to my knowledge for reasonably overlapping time periods.\n\n\n\n\n\n\n\n\n\nAnalysis Plan: Three Stages\nPart 1\nFirst we will be exploring whether there is a correlation between educational attainment and energy burden.\nHow does educational attainment affect energy burden?\nThe Apergis, Polemis, and Soursou 2021 paper concluded that across several studies on energy poverty and education in developing countries that “households with a low level of educational attainment, have restricted access to clean energy forms, such as electricity”. In the developed country context, we will test if a similar relationship exists between educational attainment and energy burden. The assumption is that energy burden is a representative measure of access instead of the binary “access/no access” scenario in developing countries.\n\\[\\text{energy burden}_i = \\beta_0 + \\beta_1 \\text{educational attainment}_i + \\epsilon_i\\] Energy burden will be represented by the average % Income needed to meet household energy needs from the LEAD Energy Affordability data Educational attainment will be represented by the % of adults with a HS diploma or less from USDA Economic Research Service data\nPart 2\nNext we will be exploring whether there is a correlation between energy burden and educational outcomes (measured by standardized math and reading scores). The idea is that examining a short-term education measure such as standardized test scores will reflect the effects of energy burden as surveyed and modeled in recent data.\nDoes energy burden affect a student’s ability to do well in school?\nThe assumption is that 3rd grade english and math standardized test scores are a representative measure of doing well in school.\nWith the energy affordability data mainly reflecting household building energy needs, it is expected that heating and cooling dominates energy spending. US Energy Information Administration estimates that more that half of household energy spending is spent on heating and cooling. The lack of thermal comfort has shown to increase the amount of mistakes by even adults. The Institute of Education Sciences has compiled literature on the optimal learning temperature based on thermal comfort (https://ies.ed.gov/ncee/edlabs/regions/west/Ask/Details/64).\nThe rationale is that although most families in America have access to electricity and basic technologies such as lighting and temperature regulation, they may be unable to take full advantage of them due to the energy burden.\n\\[\\text{standardized test scores-READING}_i = \\beta_0 + \\beta_1 \\text{energy burden}_i + \\epsilon_i\\] \\[\\text{standardized test scores-MATH}_i = \\beta_0 + \\beta_1 \\text{energy burden}_i + \\epsilon_i\\] Standardized test scores will be represented by the math and reading scores presented as average grade level performance for 3rd graders from Stanford Education Data Archive data accessed through County Health Rankings Energy burden will be represented by the average % Income needed to meet household energy needs from the LEAD Energy Affordability data\nPart 3\nModel robustness check: One of the main critiques of the models in this analysis could be that there is potential omitted variable bias. The most significant one that comes to mind is income. Is energy poverty really distinguishable and significant from poverty alone? We will test this using income as an independent variable for the regressions above. \\[\\text{energy burden}_i = \\beta_0 + \\beta_1 \\text{educational attainment}_i + \\beta_2 \\text{income}_i + \\epsilon_i\\] \\[\\text{standardized test scores-READING}_i = \\beta_0 + \\beta_1 \\text{energy burden}_i + \\beta_2 \\text{income}_i + \\epsilon_i\\] \\[\\text{standardized test scores-MATH}_i = \\beta_0 + \\beta_1 \\text{energy burden}_i + \\beta_2 \\text{income}_i + \\epsilon_i\\]\nResults\nNOTE: Kable formating has rounded very small p-values in scientific notation to 0\n\n\nTable 1: Does educational attainment affect energy burden?\n\n\n\n\nEstimate\n\n\nStd. Error\n\n\nt value\n\n\nPr(>|t|)\n\n\n(Intercept)\n\n\n1.111\n\n\n0.096\n\n\n11.553\n\n\n0\n\n\npct_hs_or_less\n\n\n0.062\n\n\n0.002\n\n\n31.206\n\n\n0\n\n\nAnswer: Since \\(p-value is < 0.001\\) we reject the null that educational attainment(% with HS diploma or less) has an effect of 0 on Average Energy Burden(% Income). We can say there is a statistically significant correlation (at the 0.1% significance level).\nThe \\(\\beta_1\\) indicates that there is a 0.062 increase in average energy burden as % Income for every percent point increase in % with HS diploma or less in a given a county.\nAlthough the estimated coefficient is positive, it is truly reflecting a negative correlation between educational attainment and energy burden. Since the educational attainment variable used is % with a high school diploma or less, an increase in this variable indicates less education attained. Therefore, with less education attained, there is an increase in energy burden.\n\n\nTable 2: Does energy burden affect reading scores (among 3rd graders)?\n\n\n\n\nEstimate\n\n\nStd. Error\n\n\nt value\n\n\nPr(>|t|)\n\n\n(Intercept)\n\n\n3.243\n\n\n0.016\n\n\n200.764\n\n\n0\n\n\navg_energy_burden_percent_income\n\n\n-0.059\n\n\n0.004\n\n\n-15.377\n\n\n0\n\n\n\n\nTable 3: Does energy burden affect math scores (among 3rd graders)?\n\n\n\n\nEstimate\n\n\nStd. Error\n\n\nt value\n\n\nPr(>|t|)\n\n\n(Intercept)\n\n\n3.233\n\n\n0.019\n\n\n170.446\n\n\n0\n\n\navg_energy_burden_percent_income\n\n\n-0.063\n\n\n0.005\n\n\n-14.016\n\n\n0\n\n\nAnswer: Since \\(p-value is < 0.001\\) we reject the null that there is that Average Energy Burden(% Income) has an effect of 0 on standardized test scores. We can say there is a statistically significant correlation (at the 0.1% significance level).\nThe \\(\\beta_1\\) indicates that there is a 0.06 decrease in average grade level in reading and math scores for every percent point increase in average energy burden as % Income in a given a county.\n\n\nTable 4: Does educational attainment affect energy burden even when considering income alone?\n\n\n\n\nEstimate\n\n\nStd. Error\n\n\nt value\n\n\nPr(>|t|)\n\n\n(Intercept)\n\n\n5.833\n\n\n0.196\n\n\n29.815\n\n\n0\n\n\npct_hs_or_less\n\n\n0.019\n\n\n0.002\n\n\n7.688\n\n\n0\n\n\nmedianincome_k\n\n\n-0.048\n\n\n0.002\n\n\n-26.920\n\n\n0\n\n\nWhen adding income to the regression as an independent variable, we can see that there is still a statistically significant correlation between educational attainment and energy burden at the 0.1% significance level. However, the effect size is noticeably smaller.\nThe \\(\\beta_1\\) indicates that there is a 0.018 increase in average energy burden as % Income for every percent point increase in % with HS diploma or less in a given a county.\n\n\nTable 5: Does energy burden affect reading scores (among 3rd graders)when considering income?\n\n\n\n\nEstimate\n\n\nStd. Error\n\n\nt value\n\n\nPr(>|t|)\n\n\n(Intercept)\n\n\n2.922\n\n\n0.050\n\n\n58.192\n\n\n0.000\n\n\navg_energy_burden_percent_income\n\n\n-0.111\n\n\n0.012\n\n\n-9.306\n\n\n0.000\n\n\nmedianincome_k\n\n\n0.001\n\n\n0.001\n\n\n1.871\n\n\n0.061\n\n\navg_energy_burden_percent_income:medianincome_k\n\n\n0.002\n\n\n0.000\n\n\n9.407\n\n\n0.000\n\n\n\n\nTable 6: Does energy burden affect math scores (among 3rd graders) when considering income?\n\n\n\n\nEstimate\n\n\nStd. Error\n\n\nt value\n\n\nPr(>|t|)\n\n\n(Intercept)\n\n\n2.907\n\n\n0.061\n\n\n47.802\n\n\n0.000\n\n\navg_energy_burden_percent_income\n\n\n-0.140\n\n\n0.014\n\n\n-9.780\n\n\n0.000\n\n\nmedianincome_k\n\n\n0.001\n\n\n0.001\n\n\n0.918\n\n\n0.359\n\n\navg_energy_burden_percent_income:medianincome_k\n\n\n0.003\n\n\n0.000\n\n\n10.290\n\n\n0.000\n\n\n\\(\\beta_1\\) indicates math and reading scores fall by 0.1 grade level for each percent increase in energy burden when income is $0.\n\\(\\beta_2\\) indicates the coefficient on median income alone when energy burden is 0% is not statistically significant different from 0.\n\\(\\beta_3\\) indicates the impact of average energy burden on math and reading scores is 0.003 grade level higher for each $1000 increase in median income. This coefficient is telling us how the relationship between standardized test score and energy varies with median income and that at higher median incomes the negative effect energy burden slowly getting dissipated.\nConclusions and Next steps\nThe first two steps of the analysis indicated that lower levels educational attainment correlate with higher levels of energy burden and higher levels of energy burden correlate with lower standardized test scores. The addition of income as independent variable and interaction showed that the initial results still generally hold true but as a smaller effect size. This indicates there may be a cycle of energy poverty that is difficult to break through because of it’s close linkage with education. To confirm this connection, further research is needed to scrutinize the existing models. With the low R^2 values, the current models are far from being predictive. Further evidence is needed to determine whether energy burdens are affecting school performance through thermal comforts or some other means.\nStarting points could be:\nAre there any other potential omitted variable biases?\nIs energy poverty able to be detached from the effects of poverty and income levels as a whole?\nWhat variables could enable the existing models to be developed into predictive models?\nAnswering these questions could help gather the needed attention on energy poverty in the US and how a targeted approach could be used to address the inequities.\nReferences\nApergis, Nicholas, Michael Polemis, and Simeoni-Eleni Soursou. 2021. “Energy Poverty and Education: Fresh Evidence from a Panel of Developing Countries.” Energy Economics, July, 105430. https://doi.org/10.1016/j.eneco.2021.105430. Bednar, Dominic J., and Tony G. Reames. 2020. “Recognition of and Response to Energy Poverty in the United States.” Nature Energy 5 (6): 432–39. https://doi.org/10.1038/s41560-020-0582-0. “County Health Rankings 2021: Codebook for Analytic Datasets.” 2018, 5. “Does Temperature Impact Student Performance? | Association for Learning Environments.” n.d. Accessed November 29, 2021a. https://healthyschools.cefpi.org/temperature.html. “———.” n.d. Accessed November 29, 2021b. https://healthyschools.cefpi.org/temperature.html. “Math Scores.” n.d. County Health Rankings & Roadmaps. Accessed November 29, 2021. https://www.countyhealthrankings.org/explore-health-rankings/measures-data-sources/county-health-rankings-model/health-factors/social-and-economic-factors/education/math-scores. “Reading Scores.” n.d. County Health Rankings & Roadmaps. Accessed November 29, 2021. https://www.countyhealthrankings.org/explore-health-rankings/measures-data-sources/county-health-rankings-model/health-factors/social-and-economic-factors/education/reading-scores. University, © Stanford, Stanford, and California 94305. n.d. “Stanford Education Data Archive (SEDA).” Accessed November 29, 2021. https://purl.stanford.edu/db586ns4974. “Use of Energy in Homes - U.S. Energy Information Administration (EIA).” n.d. Accessed November 29, 2021. https://www.eia.gov/energyexplained/use-of-energy/homes.php.\n\n\n\n",
    "preview": {},
    "last_modified": "2021-11-30T22:02:57-08:00",
    "input_file": "us-education-energy-poverty-nexus.knit.md"
  },
  {
    "path": "posts/2021-08-16-first-week-of-data-science/",
    "title": "First Week of Data Science",
    "description": "Introduction to the Data Science Mindset and filter().",
    "author": [
      {
        "name": "Unknown",
        "url": {}
      }
    ],
    "date": "2021-08-16",
    "categories": [],
    "contents": "\nDiving into Data Science World\nIn less than 2 weeks of class, I have had the opportunity to dive into data science world. It has been amazing to learn the power and versatility of R. I have learned that the data science mindset is a lot about getting to know your data before jumping into applying the tools you have. Programming is not an isolated activity but rather a community-based one with collaboration at the center of it all. When making decision in my coding, I am learning to consider reproducibility and readability so anyone can jump in and collaborate. There is an endless supply of tools and packages so finding the right requires knowing standard practice and efficiency needs.\nfilter() function\nGone are the days of endlessly filtering and creating Pivot Table after Pivot Table in Excel to get the data subset you need. I present to you filter of the dplyr package contained within the tidyverse.\nFilter is an incredibly simple and powerful function that allows you to make new data subsets based on the conditions that you specify! For example, let’s say I had a dataset containing the population of all the countries in the world named “world_pop_by_country” which had a “continent” column. Now I want just the population of countries in Asia.\nIt’s as simple as:\npop_countries_in_asia <- world_population %>% filter(country == “Asia”)\n\n\n\n",
    "preview": {},
    "last_modified": "2021-08-31T14:28:04-07:00",
    "input_file": {}
  }
]
